eshop1/app/controllers/cart_controller.rb

  def add
    @game = Game.find params[:id]
---
SELECT  `games`.* FROM `games` WHERE `games`.`id` = 11 LIMIT 1

  def remove
    @game = Game.find params[:id]
---
SELECT  `games`.* FROM `games` WHERE `games`.`id` = 9 LIMIT 1

  def clear
    @page_title = 'Vaciar carrito'
    respond_to do |format|
      format.js { @cart.cart_items.destroy_all
---
DELETE FROM `cart_items` WHERE `cart_items`.`id` = 1