eshop1/app/controllers/catalog_controller.rb

SELECT  `games`.* FROM `games` WHERE `games`.`id` = 8 LIMIT 1
---
  def show
    @game = Game.find(params[:id])

SELECT  `games`.* FROM `games` ORDER BY games.idd desc LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `games`
SELECT `developers`.* FROM `developers` WHERE `developers`.`id` IN (2, 1, 3)
SELECT `suppliers`.* FROM `suppliers` WHERE `suppliers`.`id` IN (1, 3, 2)
---
  def index
    @games = Game.order("games.id desc").includes(:suppliers, :developer).paginate(:page => params[:page], :per_page => 5)