eshop1/app/controllers/checkout_controller.rb

  def index
    @order = Order.new
    @page_title = 'Facturación'
    if @cart.games.empty?
---
SELECT  1 AS one FROM `games` INNER JOIN `cart_items` ON `games`.`id` = `cart_items`.`game_id` WHERE `cart_items`.`cart_id` = 16 LIMIT 1

  def submit_order
    @cart = Cart.find(params[:cart][:id]) # Search the cart from the cart id hidden field of the form
    @order = Order.new(order_params)
    @order.ship_to_country_code = @order.ship_to_country_code.upcase
    @order.customer_ip = request.remote_ip
    @order.status = 'open'
    @page_title = 'Facturación'
    populate_order

    if @order.save
      if @order.process
        flash[:notice] = 'Su pedido ha sido realizado y se procesará inmediatamente.'
        session[:order_id] = @order.id
        @cart.cart_items.destroy_all # empty shopping cart
---
SELECT  `carts`.* FROM `carts` WHERE `carts`.`id` = 16 LIMIT 1
INSERT INTO `orders` (`email`, `phone_number`, `ship_to_first_name`, `ship_to_last_name`, `ship_to_address`, `ship_to_city`, `ship_to_postal_code`, `ship_to_country_code`, `customer_ip`, `status`, `created_at`, `updated_at`) VALUES ('ineplay@outlook.es', '666112233', 'George', 'Jackson', 'Green Sight', 'Seville', '41000', 'VC', '127.0.0.1', 'open', '2019-04-29 16:09:39', '2019-04-29 16:09:39')
DELETE FROM `cart_items` WHERE `cart_items`.`id` = 1