eshop1/app/controllers/password_reset_controller.rb

	def create
		@user = User.find_by email: params[:email]
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'ineplay@outlook.es' LIMIT 1

	def edit
		@page_title = 'Actualizar contraseña'
		@user = User.find_using_perishable_token(params[:id])
---
SELECT  `users`.* FROM `users` WHERE (perishable_token = '9Eq9E4Je04wHKFXXJXs' and updated_at > '2019-05-16 16:14:02.542402') ORDER BY `users`.`id` ASC LIMIT 1

def update
		@user = User.find_by_id(params[:id])
		@user.password = params[:user][:password]
		@user.password_confirmation = params[:user][:password_confirmation]
		if @user.save
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
UPDATE `users` SET `password_salt` = 'gmIls5ruXsbELxVKz5', `crypted_password` = '400$8$1d$ea9474b0d93cdc94$a4759539b398409b39b2a391191c6d7c28c4e38ed82ef402382f7592ab35c6fb', `persistence_token` = 'e21b2de453d22d2642121f431995ceb2d50521c5f16831cd9965a5e36eb42e01af9c5563692ebe5509f65c56c1a787e5ce7e31d647981bd4d637528a603e94ed', `login_count` = 7, `perishable_token` = '5Ez9JJ9rBuoDRTLMVP9', `current_login_at` = '2019-05-27 10:31:03', `last_login_at` = '2019-05-23 16:57:24', `last_request_at` = '2019-05-27 10:31:03', `updated_at` = '2019-05-27 10:31:03' WHERE `users`.`id` = 2