eshop1/app/controllers/admin/game_controller.rb

INSERT INTO `games` (`name`, `developer_id`, `developed_at`, `blurb`, `pegi`, `price`, `created_at`, `updated_at`, `cover_image_file_name`, `cover_image_content_type`, `cover_image_file_size`, `cover_image_updated_at`) VALUES ('Apex', 2, '2019-04-03 19:19:00', 'Gran juego,mejor historia', 18, 0.0, '2019-04-03 19:20:04', '2019-04-03 19:20:04', 'apex-featured-image-16x9.jpg.adapt.crop191x100.1200w.jpg', 'image/jpeg', 130765, '2019-04-03 19:20:04')
---
  def create
    @game = Game.new(game_params)
    if @game.save

SELECT  `games`.* FROM `games` WHERE `games`.`id` = 1 LIMIT 1
---
  def edit
    load_data
    @game = Game.find(params[:id])

SELECT  `games`.* FROM `games` WHERE `games`.`id` = 1 LIMIT 1
UPDATE `games` SET `blurb` = '#Hola\r\n**Hola\r\nh1. Hola', `cover_image_file_name` = 'índice.jpeg', `cover_image_content_type` = 'image/jpeg', `cover_image_file_size` = 10607, `cover_image_updated_at` = '2019-05-06 17:06:58', `updated_at` = '2019-05-06 17:06:58' WHERE `games`.`id` = 1
---
  def update
    @game = Game.find(params[:id])
    if @game.update_attributes(game_params)

SELECT  `games`.* FROM `games` WHERE `games`.`id` = 1 LIMIT 1
DELETE FROM `games` WHERE `games`.`id` = 1
---
  def destroy
    @game = Game.find(params[:id])
    @game.destroy

SELECT  `games`.* FROM `games` WHERE `games`.`id` = 1 LIMIT 1
---
  def show
    @game = Game.find(params[:id])

SELECT  `games`.* FROM `games` ORDER BY developer_id LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `games`
---
  def index
    sort_by = params[:sort_by]
    @games = Game.order(sort_by).paginate(:page => params[:page], :per_page => 5)

SELECT `suppliers`.* FROM `suppliers`
SELECT `developers`.* FROM `developers`
---
    def load_data
      @suppliers = Supplier.all
      @developers = Developer.all