eshop1/app/controllers/admin/order_controller.rb

  def close
    order = Order.find(params[:id])
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 4 LIMIT 1

  def show
    @order = Order.find(params[:id])
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 4 LIMIT 1

  def destroy
    @order = Order.find(params[:id])
    @order.destroy
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1
DELETE FROM `orders` WHERE `orders`.`id` = 1