eshop1/app/controllers/admin/supplier_controller.rb

INSERT INTO `suppliers` (`first_name`, `last_name`, `created_at`, `updated_at`) VALUES ('Jorge', 'Sendero', '2019-03-25 12:15:17', '2019-03-25 12:15:17')
---
  def create
    @supplier = Supplier.new(supplier_params)
    if @supplier.save

SELECT  `suppliers`.* FROM `suppliers` WHERE `suppliers`.`id` = 1 LIMIT 1
---
  def edit
    @supplier = Supplier.find(params[:id])

SELECT  `suppliers`.* FROM `suppliers` WHERE `suppliers`.`id` = 1 LIMIT 1
UPDATE `suppliers` SET `first_name` = 'Juan', `last_name` = 'Camino', `updated_at` = '2019-03-25 12:15:06' WHERE `suppliers`.`id` = 1
---
  def update
    @supplier = Supplier.find(params[:id])
    if @supplier.update_attributes(supplier_params)

SELECT  `suppliers`.* FROM `suppliers` WHERE `suppliers`.`id` = 3 LIMIT 1
DELETE FROM `suppliers` WHERE `suppliers`.`id` = 3
---
  def destroy
    @supplier = Supplier.find(params[:id])
    @supplier.destroy

SELECT  `suppliers`.* FROM `suppliers` WHERE `suppliers`.`id` = 1 LIMIT 1
---
  def show
    @supplier = Supplier.find(params[:id])

SELECT `suppliers`.* FROM `suppliers`
---
  def index
    @suppliers = Supplier.all