eshop1/app/views/admin/game/_form.html.erb

SELECT `suppliers`.* FROM `suppliers` INNER JOIN `games_suppliers` ON `suppliers`.`id` = `games_suppliers`.`supplier_id` WHERE `games_suppliers`.`game_id` = 1
---
  <p><label for="game[supplier_ids][]">Proveedores</label><br/>
  <%= select_tag 'game[supplier_ids][]', options_from_collection_for_select(@suppliers, :id, :name,
      @game.suppliers.collect{|supplier| supplier.id}), { :multiple => true, :size => 5 } %></p>